{
  "title": "DNS System Overview",
  "sections": [
    {
      "heading": "What is DNS?",
      "content": "The Domain Name System (DNS) is the phonebook of the Internet. It translates human-friendly domain names to IP addresses, allowing browsers to load Internet resources without users needing to memorize IP addresses."
    },
    {
      "heading": "How Does DNS Work?",
      "content": "DNS resolution converts a hostname (like www.example.com) into a computer-friendly IP address. This process involves several types of DNS servers working together to find the correct address."
    },
    {
      "heading": "Types of DNS Servers",
      "items": [
        {
          "name": "DNS Recursor",
          "description": "Receives queries from client machines and makes additional requests to satisfy them."
        },
        {
          "name": "Root Nameserver",
          "description": "First step in translating host names into IP addresses; points to TLD servers."
        },
        {
          "name": "TLD Nameserver",
          "description": "Hosts the last portion of a hostname (like .com or .net)."
        },
        {
          "name": "Authoritative Nameserver",
          "description": "Final stop that holds and returns the actual DNS records."
        }
      ]
    },
    {
      "heading": "DNS Lookup Steps",
      "content": "A DNS lookup typically involves 8 steps, from entering a domain in the browser to receiving the IP address. Caching can skip some steps for faster resolution.",
      "steps": [
        "User enters a domain in the browser; query goes to DNS recursive resolver.",
        "Resolver queries a DNS root nameserver.",
        "Root server responds with the address of a TLD server.",
        "Resolver queries the TLD server.",
        "TLD server responds with the domain’s authoritative nameserver.",
        "Resolver queries the authoritative nameserver.",
        "Authoritative nameserver returns the IP address.",
        "Resolver responds to the browser with the IP address."
      ]
    },
    {
      "heading": "Types of DNS Queries",
      "items": [
        {
          "name": "Recursive Query",
          "description": "Client requires a DNS server to respond with the requested record or an error."
        },
        {
          "name": "Iterative Query",
          "description": "DNS server returns the best answer it can, or a referral to another server."
        },
        {
          "name": "Non-recursive Query",
          "description": "Occurs when the DNS server can answer from its own cache or is authoritative."
        }
      ]
    },
    {
      "heading": "DNS Caching",
      "content": "Caching stores DNS data closer to the client for faster lookups. Caching can occur in browsers, operating systems, and recursive resolvers, each with its own time-to-live (TTL) settings."
    },
    {
      "heading": "Common DNS Record Types",
      "items": [
        {
          "name": "A Record",
          "description": "Maps a domain to an IPv4 address.",
          "example": "example.com -> 93.184.216.34"
        },
        {
          "name": "AAAA Record",
          "description": "Maps a domain to an IPv6 address.",
          "example": "example.com -> 2606:2800:220:1:248:1893:25c8:1946"
        },
        {
          "name": "CNAME Record",
          "description": "Maps a domain to another domain (canonical name).",
          "example": "www.example.com -> example.com"
        },
        {
          "name": "MX Record",
          "description": "Specifies mail servers for the domain.",
          "example": "example.com -> mail.example.com"
        },
        {
          "name": "TXT Record",
          "description": "Stores text information for sources outside your domain.",
          "example": "example.com -> v=spf1 include:_spf.google.com ~all"
        }
      ]
    }
  ]
}
